; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 589537 1 2 3 5 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
)
(:goal (and
	(have_image Star5 spectrograph0)
	(have_image Phenomenon6 infrared2)
	(have_image Planet7 spectrograph0)
	(have_image Phenomenon8 thermograph1)
	(have_image Planet9 spectrograph0)
))

)

; plan
1. (turn_to satellite0 star5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 star5)
   goals met: 0 of 5
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 5
4. (calibrate satellite0 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 5
5. (turn_to satellite0 star5 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star5)
   goals met: 0 of 5
6. (turn_to satellite0 phenomenon6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon6)
   goals met: 0 of 5
7. (take_image satellite0 phenomenon6 instrument1 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 1 of 5
8. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 5
9. (turn_to satellite0 star5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
11. (turn_to satellite0 groundstation3 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 5
12. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 1 of 5
13. (turn_to satellite0 star5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star5)
   goals met: 1 of 5
14. (take_image satellite0 star5 instrument0 spectrograph0)
   added: (have_image star5 spectrograph0)
   goals met: 2 of 5
15. (turn_to satellite0 planet9 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet9)
   goals met: 2 of 5
16. (take_image satellite0 planet9 instrument0 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 3 of 5
17. (turn_to satellite0 planet7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet7)
   goals met: 3 of 5
18. (take_image satellite0 planet7 instrument0 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 4 of 5
19. (turn_to satellite0 phenomenon8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 5
20. (take_image satellite0 phenomenon8 instrument0 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 5 of 5
